---
kind: other
id: Methods.T:Autodesk.Revit.UI.Macros.ApplicationEntryPoint
source: html/b5c84a54-dc56-ffd9-f2ad-836b682641b3.htm
---
# ApplicationEntryPoint Methods

Identifies if the given command can be posted, using PostCommand(RevitCommandId) .